---
kind: method
id: M:Autodesk.Revit.DB.FillPattern.#ctor
source: html/ec498d1c-9e3e-5047-783a-eed9a0544114.htm
---
# Autodesk.Revit.DB.FillPattern.#ctor Method

Creates a fill pattern with FillPatternHostOrientation::FPORIENTATION_TO_VIEW and FillPatternTarget::FPTARGET_NONE.

## Syntax (C#)
```csharp
public FillPattern()
```